## `resources/shd/src`
#### Terraform Format and Style 🖌`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
module.src_api.data.aws_route_table.main: Reading...
module.src_api.data.aws_subnet.subnet_a: Reading...
module.src_api.data.aws_vpc.vpc: Reading...
module.src_api.data.aws_subnet.subnet_b: Reading...
module.src_api.data.aws_subnet.subnet_c: Reading...
module.src_api.data.aws_route_table.main: Read complete after 0s [id=rtb-0ad75363c371989ca]
module.src_api.data.aws_subnet.subnet_a: Read complete after 0s [id=subnet-0813446eda2ab1d8e]
module.src_api.data.aws_subnet.subnet_c: Read complete after 0s [id=subnet-029983d62d52dde8a]
module.src_api.data.aws_subnet.subnet_b: Read complete after 0s [id=subnet-0bbf03a5ca6653d46]
module.src_api.data.aws_vpc.vpc: Read complete after 3s [id=vpc-069f656ea9de1a173]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.src_api.aws_ecr_repository.main will be created
  + resource "aws_ecr_repository" "main" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "ectr-dev-i231-sample"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.src_api.aws_ecs_cluster.main will be created
  + resource "aws_ecs_cluster" "main" {
      + arn  = (known after apply)
      + id   = (known after apply)
      + name = "ecls-dev-I231-sample"
    }

  # module.src_api.aws_ecs_service.main will be created
  + resource "aws_ecs_service" "main" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "esvc-dev-I231"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + task_definition                    = (known after apply)

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = [
              + "subnet-029983d62d52dde8a",
              + "subnet-0813446eda2ab1d8e",
              + "subnet-0bbf03a5ca6653d46",
            ]
        }
    }

  # module.src_api.aws_ecs_task_definition.main will be created
  + resource "aws_ecs_task_definition" "main" {
      + arn                      = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + cpu          = 256
                  + image        = "esvc-dev-I231:latest"
                  + memory       = 512
                  + name         = "esvc-dev-I231"
                  + portMappings = [
                      + {
                          + containerPort = 80
                          + hostPort      = 80
                          + protocol      = "tcp"
                        },
                    ]
                },
            ]
        )
      + cpu                      = "256"
      + execution_role_arn       = (known after apply)
      + family                   = "etsk-dev-I231-soumu"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
    }

  # module.src_api.aws_iam_role.ecs_role will be created
  + resource "aws_iam_role" "ecs_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = <<-EOT
            {
                "Version": "2008-10-17",
                "Statement": [
                    {
                        "Sid": "",
                        "Effect": "Allow",
                        "Principal": {
                            "Service": "ecs-tasks.amazonaws.com"
                        },
                        "Action": "sts:AssumeRole"
                    }
                ]
            }
        EOT
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ecs_role"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.src_api.aws_internet_gateway.main will be created
  + resource "aws_internet_gateway" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "name" = "sample-internet-gateway"
        }
      + vpc_id   = "vpc-069f656ea9de1a173"
    }

  # module.src_api.aws_lb.main will be created
  + resource "aws_lb" "main" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = (known after apply)
      + ip_address_type            = (known after apply)
      + load_balancer_type         = "application"
      + name                       = "alb-dev-I231-sample"
      + security_groups            = (known after apply)
      + subnets                    = [
          + "subnet-029983d62d52dde8a",
          + "subnet-0813446eda2ab1d8e",
          + "subnet-0bbf03a5ca6653d46",
        ]
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)
    }

  # module.src_api.aws_lb_listener.main will be created
  + resource "aws_lb_listener" "main" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "ok"
              + status_code  = "200"
            }
        }
    }

  # module.src_api.aws_lb_listener_rule.main will be created
  + resource "aws_lb_listener_rule" "main" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + path_pattern {
              + values = [
                  + "*",
                ]
            }
        }
    }

  # module.src_api.aws_lb_target_group.main will be created
  + resource "aws_lb_target_group" "main" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + deregistration_delay               = 300
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "tg-dev-I231-sample-app"
      + port                               = 80
      + protocol                           = "HTTP"
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + target_type                        = "ip"
      + vpc_id                             = "vpc-069f656ea9de1a173"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = (known after apply)
          + path                = "/"
          + port                = "80"
          + protocol            = "HTTP"
          + timeout             = (known after apply)
          + unhealthy_threshold = 3
        }
    }

  # module.src_api.aws_route.main will be created
  + resource "aws_route" "main" {
      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + local_gateway_id           = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = "rtb-0ad75363c371989ca"
      + state                      = (known after apply)
    }

  # module.src_api.aws_route_table_association.public_1a will be created
  + resource "aws_route_table_association" "public_1a" {
      + id             = (known after apply)
      + route_table_id = "rtb-0ad75363c371989ca"
      + subnet_id      = "subnet-0813446eda2ab1d8e"
    }

  # module.src_api.aws_route_table_association.public_1c will be created
  + resource "aws_route_table_association" "public_1c" {
      + id             = (known after apply)
      + route_table_id = "rtb-0ad75363c371989ca"
      + subnet_id      = "subnet-0bbf03a5ca6653d46"
    }

  # module.src_api.aws_route_table_association.public_1d will be created
  + resource "aws_route_table_association" "public_1d" {
      + id             = (known after apply)
      + route_table_id = "rtb-0ad75363c371989ca"
      + subnet_id      = "subnet-029983d62d52dde8a"
    }

  # module.src_api.aws_security_group.alb will be created
  + resource "aws_security_group" "alb" {
      + arn                    = (known after apply)
      + description            = "alb-security-group"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "alb-security-group"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "name" = "alb-security-group"
        }
      + vpc_id                 = "vpc-069f656ea9de1a173"
    }

  # module.src_api.aws_security_group.ecs will be created
  + resource "aws_security_group" "ecs" {
      + arn                    = (known after apply)
      + description            = "handson ecs"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "security-group"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "security-group"
        }
      + vpc_id                 = "vpc-069f656ea9de1a173"
    }

  # module.src_api.aws_security_group_rule.alb will be created
  + resource "aws_security_group_rule" "alb" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.src_api.aws_security_group_rule.ecs will be created
  + resource "aws_security_group_rule" "ecs" {
      + cidr_blocks              = [
          + "10.0.0.0/16",
        ]
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

Plan: 18 to add, 0 to change, 0 to destroy.

Warning: Version constraints inside provider configuration blocks are deprecated

  on init.tf line 12, in provider "aws":
  12:   version = "3.6.0"

Terraform 0.13 and earlier allowed provider version constraints inside the
provider configuration block, but that is now deprecated and will be removed
in a future version of Terraform. To silence this warning, move the provider
version constraint into the required_providers block.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>